diagrams improved
